# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinition..::..Id Property
InternalDefinition Class See Also
---
The id of the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace